---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExtensibleStorage.DataStorage
source: html/6784dcec-3c13-55a9-9902-286603f251a6.htm
---
# DataStorage Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.